       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-MESSAGE        PIC X(20) VALUE 'HELLO, WORLD!'.
       01  WS-COUNTER        PIC 9(3) VALUE 0.
       01  WS-MAX            PIC 9(3) VALUE 5.

       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM PRINT-PARA UNTIL WS-COUNTER = WS-MAX
           STOP RUN.

       PRINT-PARA.
           ADD 1 TO WS-COUNTER
           DISPLAY WS-COUNTER ': ' WS-MESSAGE.
